etc/OpenFOAM_Sample_Files/indoor_airflow_0/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		transportProperties;
}

transportModel		Newtonian;

nu		nu [0 2 -1 0 0 0 0] 1e-05;

beta		beta [0 0 0 -1 0 0 0] 3e-03;

TRef		TRef [0 0 0 1 0 0 0] 300;

Pr		TRef [0 0 0 1 0 0 0] 300;

Prt		Prt [0 0 0 0 0 0 0] 0.7;

Cp0		1000;