etc/OpenFOAM_Sample_Files/indoor_airflow_0/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		epsilon;
}

dimensions		[0 2 -3 0 0 0 0];

internalField		uniform 0.01;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    west_window
    {

        type		fixedValue;

        value		uniform 0.01;

    }

    room
    {

        type		epsilonWallFunction;

        value		uniform 0.01;

    }

    east_window
    {

        type		zeroGradient;

    }

}